Grasshopper.Kernel.GH_Param`1.Render_AppendGeometry(Grasshopper.Kernel.GH_RenderArgs)
This function can be used to iterate over all items in the Volatile data tree
and call AppendRenderGeometry on each item that implements IGH_RenderAwareData.