Grasshopper.GUI.GH_GraphicsUtil.RenderCenteredText(System.Drawing.Graphics,System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.PointF)
Render a bit of text centered on a point.
G: Graphics object to draw with.
text: Text to draw.
font: Font to use.
color: Text color.
center: Center point.