Grasshopper.GUI.GH_AsynchFileData.Location
Gets the location this class is watching.

Grasshopper.GUI.GH_AsynchFileData.#ctor(System.String,System.Boolean)
Synchronous constructor.
location: Location of file
includeThumbnail: If true, thumbnail data will be loaded.

Grasshopper.GUI.GH_AsynchFileData.#ctor(System.String,System.Boolean,Grasshopper.GUI.GH_AsynchFileData.FileChangedDelegate)
Asynchronous constructor. File properties will be loaded asychronously.
location: Location of file
includeThumbnail: If true, thumbnail data will be loaded.
callback: Callback delegate for file changes.

Grasshopper.GUI.GH_AsynchFileData.LocalUpdatePeriod
Specifies the recommended number of milliseconds in between periodic checks for files on the local system.

Grasshopper.GUI.GH_AsynchFileData.RemoteUpdatePeriod
Specifies the recommended number of milliseconds in between periodic checks for files on network drives.

Grasshopper.GUI.GH_AsynchFileData.StartPeriodicUpdate
Starts periodic updating (from now), using typical periods depending on the physical location of the file.
If you call this method you must call StopPeriodicUpdate() when done.

Grasshopper.GUI.GH_AsynchFileData.StartPeriodicUpdate(System.Int32)
Starts periodic updating (from now).
period: Milliseconds between updates.

Grasshopper.GUI.GH_AsynchFileData.StartPeriodicUpdate(System.TimeSpan)
Starts periodic updating (from now).
period: Period between updates.

Grasshopper.GUI.GH_AsynchFileData.ReadThumbnail
Gets or sets whether the thumbnail ought to be parsed.
At the moment this only makes sense for GH/GHX files.

Grasshopper.GUI.GH_AsynchFileData.CallbackDelegate
Gets or sets the callback delegate to be used when properties are updated.

Grasshopper.GUI.GH_AsynchFileData.FileDataAge
Gets the time from which the current file data stems.