Grasshopper.Kernel.GH_Document.IsPreviewViewport(Rhino.Display.RhinoViewport,Rhino.RhinoDoc)
Validate a viewport to see if we should be drawing previews into it.
vp: Viewport.
doc: Document associated with viewport.
Returns: True if previews ought to be drawn into this viewport.