Rhino.Render.RenderContent.GetString(UnsafeNativeMethods.StringIds)
Internal method used to get string values from the C++ SDK
which: Id of string value to get
Returns: Returns the requested string value.