Rhino.DocObjects.Tables.LayerTable.FindName(System.String,System.Guid)
Finds the layer with a given name. If multiple layers exist that have the same name, the
first match layer index will be returned.
Deleted layers have no name.
layerName: name of layer to search for. The search ignores case.
parentId: Id of the parent layer to search.
Returns:
index of the layer with the given name.
If no layer is found, null is returned.