Rhino.DocObjects.ManagedFont.FontWeight
Weight enum values
Avoid casting these values to int.
Use ON_Font::WindowsLogfontWeightFromWeight() or
ON_Font::AppleWeightOfFontFromWeight() or
add another converter.

Rhino.DocObjects.ManagedFont.FontWeight.Unset
Not set.

Rhino.DocObjects.ManagedFont.FontWeight.Thin
IsLight = true

Rhino.DocObjects.ManagedFont.FontWeight.Ultralight
IsLight = true

Rhino.DocObjects.ManagedFont.FontWeight.Light
IsLight = true

Rhino.DocObjects.ManagedFont.FontWeight.Normal
Default font weight. IsNormalWeight = true

Rhino.DocObjects.ManagedFont.FontWeight.Medium
IsNormalWeight = true

Rhino.DocObjects.ManagedFont.FontWeight.Semibold
IsBold = true

Rhino.DocObjects.ManagedFont.FontWeight.Bold
IsBold = true

Rhino.DocObjects.ManagedFont.FontWeight.Ultrabold
IsBold = true

Rhino.DocObjects.ManagedFont.FontWeight.Heavy
IsBold = true