Rhino.DocObjects.AnnotationStyle.ContentAngle
Angle for text or other leader content

Rhino.DocObjects.AnnotationStyle.ContentAngle.Horizontal
Horizontal in coordinate system

Rhino.DocObjects.AnnotationStyle.ContentAngle.Aligned
Aligned with last leader direction

Rhino.DocObjects.AnnotationStyle.ContentAngle.Rotated
Explicit angle

Rhino.DocObjects.AnnotationStyle.ContentAngle.HorizontalToScreen
Stays horizontal and front facing