Rhino.DocObjects.AnnotationStyle.Field
Field identifiers used for file i/o and getting/setting values

Rhino.DocObjects.AnnotationStyle.Field.Unset


Rhino.DocObjects.AnnotationStyle.Field.Name


Rhino.DocObjects.AnnotationStyle.Field.Index


Rhino.DocObjects.AnnotationStyle.Field.ExtensionLineExtension


Rhino.DocObjects.AnnotationStyle.Field.ExtensionLineOffset


Rhino.DocObjects.AnnotationStyle.Field.Arrowsize


Rhino.DocObjects.AnnotationStyle.Field.LeaderArrowsize


Rhino.DocObjects.AnnotationStyle.Field.Centermark


Rhino.DocObjects.AnnotationStyle.Field.TextGap


Rhino.DocObjects.AnnotationStyle.Field.TextHeight


Rhino.DocObjects.AnnotationStyle.Field.TextAlignment


Rhino.DocObjects.AnnotationStyle.Field.LengthFormat


Rhino.DocObjects.AnnotationStyle.Field.LengthResolution


Rhino.DocObjects.AnnotationStyle.Field.AngleFormat


Rhino.DocObjects.AnnotationStyle.Field.AngleResolution


Rhino.DocObjects.AnnotationStyle.Field.Font


Rhino.DocObjects.AnnotationStyle.Field.LengthFactor


Rhino.DocObjects.AnnotationStyle.Field.Alternate


Rhino.DocObjects.AnnotationStyle.Field.AlternateLengthFactor


Rhino.DocObjects.AnnotationStyle.Field.AlternateLengthFormat


Rhino.DocObjects.AnnotationStyle.Field.AlternateLengthResolution


Rhino.DocObjects.AnnotationStyle.Field.Prefix


Rhino.DocObjects.AnnotationStyle.Field.Suffix


Rhino.DocObjects.AnnotationStyle.Field.AlternatePrefix


Rhino.DocObjects.AnnotationStyle.Field.AlternateSuffix


Rhino.DocObjects.AnnotationStyle.Field.DimensionLineExtension


Rhino.DocObjects.AnnotationStyle.Field.SuppressExtension1


Rhino.DocObjects.AnnotationStyle.Field.SuppressExtension2


Rhino.DocObjects.AnnotationStyle.Field.ExtLineColorSource


Rhino.DocObjects.AnnotationStyle.Field.DimLineColorSource


Rhino.DocObjects.AnnotationStyle.Field.ArrowColorSource


Rhino.DocObjects.AnnotationStyle.Field.TextColorSource


Rhino.DocObjects.AnnotationStyle.Field.ExtLineColor


Rhino.DocObjects.AnnotationStyle.Field.DimLineColor


Rhino.DocObjects.AnnotationStyle.Field.ArrowColor


Rhino.DocObjects.AnnotationStyle.Field.TextColor


Rhino.DocObjects.AnnotationStyle.Field.ExtLinePlotColorSource


Rhino.DocObjects.AnnotationStyle.Field.DimLinePlotColorSource


Rhino.DocObjects.AnnotationStyle.Field.ArrowPlotColorSource


Rhino.DocObjects.AnnotationStyle.Field.TextPlotColorSource


Rhino.DocObjects.AnnotationStyle.Field.ExtLinePlotColor


Rhino.DocObjects.AnnotationStyle.Field.DimLinePlotColor


Rhino.DocObjects.AnnotationStyle.Field.ArrowPlotColor


Rhino.DocObjects.AnnotationStyle.Field.TextPlotColor


Rhino.DocObjects.AnnotationStyle.Field.ExtLinePlotWeightSource


Rhino.DocObjects.AnnotationStyle.Field.DimLinePlotWeightSource


Rhino.DocObjects.AnnotationStyle.Field.ExtLinePlotWeight_mm


Rhino.DocObjects.AnnotationStyle.Field.DimLinePlotWeight_mm


Rhino.DocObjects.AnnotationStyle.Field.ToleranceFormat


Rhino.DocObjects.AnnotationStyle.Field.ToleranceResolution


Rhino.DocObjects.AnnotationStyle.Field.ToleranceUpperValue


Rhino.DocObjects.AnnotationStyle.Field.ToleranceLowerValue


Rhino.DocObjects.AnnotationStyle.Field.AltToleranceResolution


Rhino.DocObjects.AnnotationStyle.Field.ToleranceHeightScale


Rhino.DocObjects.AnnotationStyle.Field.BaselineSpacing


Rhino.DocObjects.AnnotationStyle.Field.DrawMask


Rhino.DocObjects.AnnotationStyle.Field.MaskColorSource


Rhino.DocObjects.AnnotationStyle.Field.MaskColor


Rhino.DocObjects.AnnotationStyle.Field.MaskBorder


Rhino.DocObjects.AnnotationStyle.Field.DimensionScale


Rhino.DocObjects.AnnotationStyle.Field.DimscaleSource


Rhino.DocObjects.AnnotationStyle.Field.FixedExtensionLength


Rhino.DocObjects.AnnotationStyle.Field.FixedExtensionOn


Rhino.DocObjects.AnnotationStyle.Field.TextRotation


Rhino.DocObjects.AnnotationStyle.Field.SuppressArrow1


Rhino.DocObjects.AnnotationStyle.Field.SuppressArrow2


Rhino.DocObjects.AnnotationStyle.Field.TextmoveLeader


Rhino.DocObjects.AnnotationStyle.Field.ArclengthSymbol


Rhino.DocObjects.AnnotationStyle.Field.StackTextheightScale


Rhino.DocObjects.AnnotationStyle.Field.StackFormat


Rhino.DocObjects.AnnotationStyle.Field.AltRound


Rhino.DocObjects.AnnotationStyle.Field.Round


Rhino.DocObjects.AnnotationStyle.Field.AngularRound


Rhino.DocObjects.AnnotationStyle.Field.AltZeroSuppress


Rhino.DocObjects.AnnotationStyle.Field.ToleranceZeroSuppress


Rhino.DocObjects.AnnotationStyle.Field.AngleZeroSuppress


Rhino.DocObjects.AnnotationStyle.Field.ZeroSuppress


Rhino.DocObjects.AnnotationStyle.Field.AltBelow


Rhino.DocObjects.AnnotationStyle.Field.ArrowType1


Rhino.DocObjects.AnnotationStyle.Field.ArrowType2


Rhino.DocObjects.AnnotationStyle.Field.LeaderArrowType


Rhino.DocObjects.AnnotationStyle.Field.ArrowBlockId1


Rhino.DocObjects.AnnotationStyle.Field.ArrowBlockId2


Rhino.DocObjects.AnnotationStyle.Field.LeaderArrowBlock


Rhino.DocObjects.AnnotationStyle.Field.LdrContentType


Rhino.DocObjects.AnnotationStyle.Field.TextVerticalAlignment


Rhino.DocObjects.AnnotationStyle.Field.LdrVerticalAlignment


Rhino.DocObjects.AnnotationStyle.Field.ContentAngle


Rhino.DocObjects.AnnotationStyle.Field.LdrCurveType


Rhino.DocObjects.AnnotationStyle.Field.LeaderContentAngle


Rhino.DocObjects.AnnotationStyle.Field.LeaderHasLanding


Rhino.DocObjects.AnnotationStyle.Field.LeaderLandingLength


Rhino.DocObjects.AnnotationStyle.Field.MaskFlags


Rhino.DocObjects.AnnotationStyle.Field.CentermarkStyle


Rhino.DocObjects.AnnotationStyle.Field.TextHorizontalAlignment


Rhino.DocObjects.AnnotationStyle.Field.LeaderHorizontalAlignment


Rhino.DocObjects.AnnotationStyle.Field.DrawForward


Rhino.DocObjects.AnnotationStyle.Field.SignedOrdinate


Rhino.DocObjects.AnnotationStyle.Field.UnitSystem


Rhino.DocObjects.AnnotationStyle.Field.Count
