Rhino.PlugIns.RenderPlugIn.Render(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.RenderPlugIn.RenderOptions)
Called by Render and RenderPreview commands if this plug-in is set as
the default render engine.
doc: A document.
mode: A command running mode.
options:
Combined RenderOptions values indicating what mode to render in.
Returns:
If true, then the renderer is required to construct a rapid preview and
not the high-quality final result.