Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})
Append a collection of points and normal vectors to this point cloud.
points: Points to append.
normals: Normal Vectors to append.

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Append a collection of points and normal vectors to this point cloud.
points: Points to append.
colors: Colors to append.