Rhino.Geometry.V6LinearDimension.GetTextTransform(Rhino.DocObjects.AnnotationStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Get the transform for this text object's text geometry
style:
textscale:
camX:
camY:
draw_forward: