Rhino.UI.LengthValue.StringFormat
ON_LengthValue::StringFormat identifies the formatting to apply when creating
a length value from a double.

Rhino.UI.LengthValue.StringFormat.ExactDecimal
Use exact decimal string.

Rhino.UI.LengthValue.StringFormat.ExactProperFraction
If possible, use exact integer-fraction format (1.125 becomes 1-1/8).

Rhino.UI.LengthValue.StringFormat.ExactImproperFraction
If possible, use exact fraction format (1.125 becomes 9/8).

Rhino.UI.LengthValue.StringFormat.CleanDecimal
The value may be adjusted slightly to improve clarity (1.124999... becomes 1.125).

Rhino.UI.LengthValue.StringFormat.CleanProperFraction
The value may be adjusted slightly to improve clarity (1.124999... becomes 1-1/8).

Rhino.UI.LengthValue.StringFormat.CleanImproperFraction
The value may be adjusted slightly to improve clarity (1.124999... becomes 9/8).