Rhino.DocObjects.AnnotationStyle.LengthDisplayFormat
Defines display formats for distances.

Rhino.DocObjects.AnnotationStyle.LengthDisplayFormat.Decimal
Decimal units.

Rhino.DocObjects.AnnotationStyle.LengthDisplayFormat.Fractional
Fractional units.

Rhino.DocObjects.AnnotationStyle.LengthDisplayFormat.FeetInches
Feet and Inches.

Rhino.DocObjects.AnnotationStyle.LengthDisplayFormat.FeetDecimalInches
Feet and Decimal Inches.