Rhino.DocObjects.TextStyle
Description of the visual characteristics of text

Rhino.DocObjects.TextStyle.#ctor
Creates a new non-document control ON_Font

Rhino.DocObjects.TextStyle.ComponentType
Returns Rhino.DocObjects.ModelComponentType.TextStyle.