Rhino.DocObjects.AnnotationStyle.ToleranceDisplayFormat
Style of tolerance display for dimensions

Rhino.DocObjects.AnnotationStyle.ToleranceDisplayFormat.None
No tolerance display

Rhino.DocObjects.AnnotationStyle.ToleranceDisplayFormat.Symmetrical
Symmetrical +/- tolerance

Rhino.DocObjects.AnnotationStyle.ToleranceDisplayFormat.Deviation
Distance +tol, -tol

Rhino.DocObjects.AnnotationStyle.ToleranceDisplayFormat.Limits
Distance upper and lower limits