Rhino.DocObjects.AnnotationStyle
This class can be considered a namespace.
This comment is here to avoid warnings.

Rhino.DocObjects.AnnotationStyle.CommitChanges
If HasFieldOverrides() for this AnnotationStyle is true, this AnnotationStyle becomes
the parent of a new AnnotationStyle made by CommitChanges.  The new Child AnnotationStyle overrides
the fields marked as overridden in this AnnotationStyle. The new AnnotationStyle has a
name generated from the name of the AnnotationStyle in the Style table with the Id of this
AnnotationStyle.
If this is successful, CommitChanges returns the Id of the new child AnnotationStyle,
and if not succesful, returns Guid.Empty
Use SetFieldOverride() to mark a field as an override, and set the field value to the
desired value to use to override the field. Calling SetFieldOverride(field, true) causes
HasFieldOverrides() to return true.
If HasFieldOverrides() returns false, CommitChanges will replace the AnnotationStyle in the
table with a copy of this AnnotationStyle and return this AnnotationStyle's Id if successful
or Guid.Empty if not.

Rhino.DocObjects.AnnotationStyle.TextAlignment
For dimension text - AboveLine, InLine, Horizontal

Rhino.DocObjects.AnnotationStyle.LengthFormat


Rhino.DocObjects.AnnotationStyle.AlternateLengthFormat


Rhino.DocObjects.AnnotationStyle.AngleFormat


Rhino.DocObjects.AnnotationStyle.ToleranceFormat


Rhino.DocObjects.AnnotationStyle.m_original_mask_color_source
Should be ON::object_color_source

Rhino.DocObjects.AnnotationStyle.StackFractionFormat


Rhino.DocObjects.AnnotationStyle.ZeroSuppress


Rhino.DocObjects.AnnotationStyle.AlternateZeroSuppress


Rhino.DocObjects.AnnotationStyle.ToleranceZeroSuppress


Rhino.DocObjects.AnnotationStyle.AngleZeroSuppress


Rhino.DocObjects.AnnotationStyle.ArrowType1


Rhino.DocObjects.AnnotationStyle.ArrowType2


Rhino.DocObjects.AnnotationStyle.LeaderArrowType


Rhino.DocObjects.AnnotationStyle.TextMoveLeader


Rhino.DocObjects.AnnotationStyle.ArcLengthSymbol


Rhino.DocObjects.AnnotationStyle.LengthResolution


Rhino.DocObjects.AnnotationStyle.AlternateLengthResolution


Rhino.DocObjects.AnnotationStyle.ToleranceResolution


Rhino.DocObjects.AnnotationStyle.AlternateToleranceResolution


Rhino.DocObjects.AnnotationStyle.m_original_mask_color


Rhino.DocObjects.AnnotationStyle.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.

Rhino.DocObjects.AnnotationStyle.IsFieldOverride(Rhino.DocObjects.AnnotationStyle.Field)
Normally, an AnnotationStyle is neither a Child nor a Parent.
Setting the value of AnnotationStyle.ParentId to the Id of another
AnnotationStyle makes that style the Parent of this style.
Fields in a AnnotationStyle can get their values from the
Child style or the Parent style.
If a field is marked overridden in the Child style,
the value of that field comes from the Parent.
Typically, when an individual field is overridden for a specific annotation
object, a Child AnnotationStyle is made with that field marked as
an overridden field (SetFieldOverride()) and that AnnotationStyle is
made the Child of the annotation object's AnnotationStyle.
Then the AnnotationStyleId of the annotation object is set to the
Id of the Child style
AnnotationStyle.IsFieldOverride(Field field_id)
Returns:
True if the field corresponding to field_id is overridden in this AnnotationStyle
False if the field is not overridden

Rhino.DocObjects.AnnotationStyle.SetFieldOverride(Rhino.DocObjects.AnnotationStyle.Field,System.Boolean)
AnnotationStyle.SetFieldOverride()
Set the field corresponding to field_id to overridden or not overridden
field_id:
bOverride:

Rhino.DocObjects.AnnotationStyle.ClearAllFieldOverrides
AnnotationStyle.ClearAllFieldOverrides()
Sets all the fields in this AnnotationStyle to be not overridden
Does not change any dimstyle_id's or parent_id's

Rhino.DocObjects.AnnotationStyle.HasFieldOverrides
AnnotationStyle.HasFieldOverrides()
Checks if any fields in this AnnotationStyle are overrides
Returns:
True if any fields are overrides
False is no fields are overrides

Rhino.DocObjects.AnnotationStyle.OverrideFields(Rhino.DocObjects.AnnotationStyle,Rhino.DocObjects.AnnotationStyle)
AnnotationStyle.OverrideFields()
Change the fields in this AnnotationStyle to match the fields of the
source AnnotationStyle for all of the fields that are marked overridden in the source
and to match the fields of the parent AnnotationStyle for all of the fields not marked
overriden in the source.
source_dimstyle:
parent_dimstyle:
Returns:
Returns true if any overrides were set.

Rhino.DocObjects.AnnotationStyle.InheritFields(Rhino.DocObjects.AnnotationStyle)
AnnotationStyle.InheritFields()
Change the fields in this AnnotationStyle to match the fields of the
parent AnnotationStyle for all of the fields that are not marked overridden in the
this AnnotationStyle.
parent_dimstyle:
Returns:

Rhino.DocObjects.AnnotationStyle.IsChildDimStyle
AnnotationStyle.IsChildDimstyle()
Tests if this AnnotationStyle is a child of any other AnnotationStyle
Returns:
True if this is a child AnnotationStyle,
False otherwise.

Rhino.DocObjects.AnnotationStyle.IsChildOf(System.Guid)
AnnotationStyle.IsChildOf()
Tests if this AnnotationStyle is a child of a specific AnnotationStyle
parent_id:
Returns:
True if this is a child of the AnnotationStyle with Parent
False otherwise.

Rhino.DocObjects.AnnotationStyle.ParentId
Get or Set the Id of this AnnotationStyle's parent.
If ParentId is Guid.Empty, this AnnotationStyle has no parent