Rhino.DocObjects.AnnotationStyle.ZeroSuppression
Marks leading and trailing zeros for removal.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.NoZeroSuppress
No zero suppression.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressLeading
Suppress leadidng zeros.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressTrailing
Suppress trailing zeros.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressLeadingAndTrailing
Suppress leading and trailing zeros.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressZeroFeet
Suppress zero feet.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressZeroInches
Suppress zero inches.

Rhino.DocObjects.AnnotationStyle.ZeroSuppression.SuppressZeroFeetAndZeroInches
Suppress zero feet and zero inches.