Rhino.Geometry.AnnotationText
Supports rich text in Rhino.

Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.AnnotationStyle,Rhino.DocObjects.AnnotationStyle.HorizontalAlignment,Rhino.DocObjects.AnnotationStyle.VerticalAlignment,System.Double,System.Double)
Create RichText geometry or null if input is invalid
richTextString:
plane:
style:
horizontalAlignment:
verticalAlignment:
rectWidth:
rectHeight:
Returns:

Rhino.Geometry.AnnotationText.GetTextTransform(System.Double,Rhino.DocObjects.AnnotationStyle)
Get the transform for this text object's text geometry
textscale:
dimstyle:

Rhino.Geometry.AnnotationText.AnnotationStyleId
Get this text's dimstyle

Rhino.Geometry.AnnotationText.SetAnnotationStyleId(System.Guid,Rhino.RhinoDoc)
Set this text's dimstyle id.
This causes the text runs to be recreated with the properties from the corresponding AnnotationStyle
dimstyle_id:
doc:

Rhino.Geometry.AnnotationText.GetAnnotationStyle(Rhino.RhinoDoc)
Get this text's dimstyle

Rhino.Geometry.AnnotationText.SetAnnotationStyle(Rhino.DocObjects.AnnotationStyle,Rhino.RhinoDoc)
Set this text's AnnotationStyle
style:
doc:

Rhino.Geometry.AnnotationText.FormatWidth
Text format width

Rhino.Geometry.AnnotationText.FormatHeight
Text format height