Rhino.FileIO.CommonComponentTable`1.FindNameHash(Rhino.FileIO.NameHash)
Uses the hash of the name to find a model component.
Deleted objects have no name.
nameHash: NameHash of model component to search for.
Returns: Reference to the rhino object or null if no such object could be found.