Rhino.FileIO.FileReference
Manages a reference to an existing or nonexisting file,
using either or both absolute or relative paths.

Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)
Constructs a new instance of hte FileReference class,
given