Rhino.DocObjects.AnnotationStyle.AngleDisplayFormat
Display format for angles

Rhino.DocObjects.AnnotationStyle.AngleDisplayFormat.DecimalDegrees
Decimal Degrees

Rhino.DocObjects.AnnotationStyle.AngleDisplayFormat.DegMinSec
Degrees Minutes Seconds

Rhino.DocObjects.AnnotationStyle.AngleDisplayFormat.Radians
Decimal Radians

Rhino.DocObjects.AnnotationStyle.AngleDisplayFormat.Grads
Decimal Gradians