Rhino.DocObjects.AnnotationStyle.CenterMarkStyle
Style for drawing centermark for Radial dimensions and Centermark objects

Rhino.DocObjects.AnnotationStyle.CenterMarkStyle.None
No centermark display

Rhino.DocObjects.AnnotationStyle.CenterMarkStyle.Mark
+ mark only

Rhino.DocObjects.AnnotationStyle.CenterMarkStyle.MarkAndLines
+ mark and lines to radius