Rhino.DocObjects.AnnotationStyle.StackDisplayFormat
Format of stacked fractions

Rhino.DocObjects.AnnotationStyle.StackDisplayFormat.NoStack
No stacking

Rhino.DocObjects.AnnotationStyle.StackDisplayFormat.StackHorizontal
Stack with horizontal line

Rhino.DocObjects.AnnotationStyle.StackDisplayFormat.StackDiagonal
Stack with angled line