Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.AnnotationStyle,Rhino.Geometry.Point3d[],System.Guid)
Creates a RLeader geometry object
richTextString:
plane:
style:
points:
dimstyle_id:
Returns:

Rhino.Geometry.RLeader.SetTextString(System.String,Rhino.RhinoDoc,Rhino.DocObjects.AnnotationStyle.StackDisplayFormat,System.Double)
Sets the text string for this leader