Rhino.PlugIns.RenderPlugIn.RenderOptions
Render options, may include one or more of these values.

Rhino.PlugIns.RenderPlugIn.RenderOptions.None
Just render...

Rhino.PlugIns.RenderPlugIn.RenderOptions.FastPreview
If set, lower quality faster render expected