Rhino.DocObjects.ModelComponent
Provides a base class for all components in a  model and manages the
index, id and other information common to this type of objects.
This class parallels ON_ModelComponent.

Rhino.DocObjects.ModelComponent.Id
Gets or sets the ID of the current instance.
Throws System.InvalidOperationException:
When setting the ID failed.
This usually happend because the instance ID is already locked.

Rhino.DocObjects.ModelComponent.Name
Gets or sets the name of the
Throws System.InvalidOperationException:
When setting the Name failed.
This usually happend because the instance Name is already locked.