Rhino.UI.ScaleValue
Represents a Scale Value

Rhino.UI.ScaleValue.#ctor
Default constructor

Rhino.UI.ScaleValue.#ctor(Rhino.UI.ScaleValue)
Copy constructor

Rhino.UI.ScaleValue.OneToOne
Make a new ScaleValue set to OneToOne
Returns:

Rhino.UI.ScaleValue.Create(Rhino.Input.StringParserSettings,System.String)
Create from string
ps:
str:

Rhino.UI.ScaleValue.Create(Rhino.UI.LengthValue,Rhino.UI.LengthValue,Rhino.UI.ScaleValue.ScaleStringFormat)
Create from 2 length values
left_value:
right_value:
format:

Rhino.UI.ScaleValue.Finalize


Rhino.UI.ScaleValue.ConstPointer


Rhino.UI.ScaleValue.NonConstPointer


Rhino.UI.ScaleValue.Dispose


Rhino.UI.ScaleValue.Dispose(System.Boolean)
disposing:

Rhino.UI.ScaleValue.IsUnset
Test IsUnset
Returns:

Rhino.UI.ScaleValue.LeftLengthValue
Get the Left LengthValue from Scale
Returns:

Rhino.UI.ScaleValue.RightLengthValue
Get the Right LengthValue from Scale
Returns:

Rhino.UI.ScaleValue.LeftToRightScale
LeftLengthValue / RightLengthValue

Rhino.UI.ScaleValue.RightToLeftScale
RightLengthValue / LeftLengthValue