Rhino.UI.LengthValue
Represents a length value

Rhino.UI.LengthValue.#ctor
Default constructor

Rhino.UI.LengthValue.#ctor(Rhino.UI.LengthValue)
Copy
otherLengthValue:

Rhino.UI.LengthValue.Finalize


Rhino.UI.LengthValue.ConstPointer
Const pointer

Rhino.UI.LengthValue.NonConstPointer
Non const pointer

Rhino.UI.LengthValue.Dispose


Rhino.UI.LengthValue.Dispose(System.Boolean)
disposing:

Rhino.UI.LengthValue.CreateFromString(Rhino.Input.StringParserSettings@,System.String)
Create from string
Parses the input string according to the parse settings argument
ps: Parse settings
str: String to parse

Rhino.UI.LengthValue.CreateFromSubstring(Rhino.Input.StringParserSettings@,System.String,System.Int32@)
Create from string
ps:
str:
parsed_count:  Number of chars in the string that were parsed

Rhino.UI.LengthValue.CreateFromSubstring(Rhino.Input.StringParserSettings@,System.String,System.Boolean@)
Create from string
ps:
str:
parsed_all: true if the whole string was parsed

Rhino.UI.LengthValue.CreateFromUnitSystem(System.Double,Rhino.UnitSystem,System.UInt32,Rhino.UI.LengthValue.StringFormat,System.Double)
Create from Length and UnitSystem
length: Numeric length value
us: Unit system
local_id:
str_fmt:
clean_format_tol:

Rhino.UI.LengthValue.Length(Rhino.UnitSystem)
Length value
us:
Returns:

Rhino.UI.LengthValue.LengthString
Return length as a string
Returns:

Rhino.UI.LengthValue.ChangeLength(System.Double)
Changes the numeric value in a LengthValue and leaves all of the other info unchanged
UnitSystem, ParseSettings and StringFormat stay as they were
new_length:
Returns: A new LengthValue

Rhino.UI.LengthValue.ChangeUnitSystem(Rhino.UnitSystem)
Change the UnitSystem of a LengthValue
The numeric value of Length is scaled by new_us / current unit system
so that the absolute length stays the same
new_us:
Returns:

Rhino.UI.LengthValue.ParseSettings
Parse settings

Rhino.UI.LengthValue.UnitSystem
UnitSystem used by this LengthValue

Rhino.UI.LengthValue.LengthStringFormat
Returns the StringFormat from this LengthValue

Rhino.UI.LengthValue.ContextLocaleId
returns the context LocaleId from this LengthValue

Rhino.UI.LengthValue.ContextAngleUnitSystem
Returns the context AngleUnitSystem from this LengthValue's ParseSettings

Rhino.UI.LengthValue.IsUnset
Test IsUnset
Returns: