Rhino.DocObjects.AnnotationStyle.LeaderContentType
Type of leader content

Rhino.DocObjects.AnnotationStyle.LeaderContentType.NoContent


Rhino.DocObjects.AnnotationStyle.LeaderContentType.Text


Rhino.DocObjects.AnnotationStyle.LeaderContentType.TextDot


Rhino.DocObjects.AnnotationStyle.LeaderContentType.Block
