Rhino.UI.AngleValue
Represents a length value

Rhino.UI.AngleValue.#ctor
Default constructor

Rhino.UI.AngleValue.#ctor(Rhino.UI.AngleValue)
Copy
otherAngleValue:

Rhino.UI.AngleValue.Finalize


Rhino.UI.AngleValue.ConstPointer
Const pointer

Rhino.UI.AngleValue.NonConstPointer
Non const pointer

Rhino.UI.AngleValue.Dispose


Rhino.UI.AngleValue.Dispose(System.Boolean)
disposing:

Rhino.UI.AngleValue.Create(Rhino.Input.StringParserSettings,System.String)
Create from string
ps:
str:

Rhino.UI.AngleValue.Create(System.Double,Rhino.AngleUnitSystem,System.UInt32,System.Boolean)
Create from Angle and UnitSystem
angle:
us:
local_id:
bUseFractions:

Rhino.UI.AngleValue.Angle(Rhino.AngleUnitSystem)
Angle value
us:
Returns:

Rhino.UI.AngleValue.AngleString
Return angle as a string
Returns:

Rhino.UI.AngleValue.ParseSettings
Parse settings

Rhino.UI.AngleValue.IsUnset
Test IsUnset
Returns: