Rhino.DocObjects.AnnotationStyle.LeaderCurveStyle
Type of leader curve

Rhino.DocObjects.AnnotationStyle.LeaderCurveStyle.NoCurve


Rhino.DocObjects.AnnotationStyle.LeaderCurveStyle.Polyline


Rhino.DocObjects.AnnotationStyle.LeaderCurveStyle.Spline
