Rhino.DocObjects.AnnotationStyle.MaskType
Text mask drawn with background color or explicit color

Rhino.DocObjects.AnnotationStyle.MaskType.BackgroundColor
Text mask drawn with background color

Rhino.DocObjects.AnnotationStyle.MaskType.MaskColor
Text mask drawn with explicit color