Rhino.Render.RealtimeDisplayMode.StartRender(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)
Override to start your render engine
w:
h:
doc:
view:
viewportInfo:
forCapture:
renderWindow:
Returns: true when your render engine started correctly, false when that failed

Rhino.Render.RealtimeDisplayMode.ShutdownRender
Override to shutdown your render engine

Rhino.Render.RealtimeDisplayMode.RestartRender(System.Int32,System.Int32)
Override to restart your render engine
width:
height:
Returns:

Rhino.Render.RealtimeDisplayMode.IsRenderframeAvailable
Override to tell if your render engine has completed a frame for drawing into the viewport
Returns:

Rhino.Render.RealtimeDisplayMode.RenderEngineDraw
Call this to rendering (e.g. into OGL)
Returns: