Rhino.DocObjects.ManagedFont.FontStyle
Vertical angle of font
Upright, Italic, or Oblique

Rhino.DocObjects.ManagedFont.FontStyle.Unset
Not set.

Rhino.DocObjects.ManagedFont.FontStyle.Upright
Default font style.

Rhino.DocObjects.ManagedFont.FontStyle.Italic


Rhino.DocObjects.ManagedFont.FontStyle.Oblique
