Rhino.DocObjects.AnnotationStyle.HorizontalAlignment
Attachment of content

Rhino.DocObjects.AnnotationStyle.HorizontalAlignment.Left
Left aligned

Rhino.DocObjects.AnnotationStyle.HorizontalAlignment.Center
Centered

Rhino.DocObjects.AnnotationStyle.HorizontalAlignment.Right
Right aligned