Rhino.DocObjects.AnnotationStyle.ArrowType
Defines enumerated values for arrowhead shapes.

Rhino.DocObjects.AnnotationStyle.ArrowType.NoArrow


Rhino.DocObjects.AnnotationStyle.ArrowType.UserBlock


Rhino.DocObjects.AnnotationStyle.ArrowType.SolidTriangle


Rhino.DocObjects.AnnotationStyle.ArrowType.Dot


Rhino.DocObjects.AnnotationStyle.ArrowType.Tick


Rhino.DocObjects.AnnotationStyle.ArrowType.ShortTriangle


Rhino.DocObjects.AnnotationStyle.ArrowType.OpenArrow


Rhino.DocObjects.AnnotationStyle.ArrowType.Rectangle


Rhino.DocObjects.AnnotationStyle.ArrowType.LongTriangle


Rhino.DocObjects.AnnotationStyle.ArrowType.LongerTriangle
