Rhino.DocObjects.Tables.DimStyleTable.CurrentAnnotationStyleIndex


Rhino.DocObjects.Tables.DimStyleTable.Delete(Rhino.DocObjects.AnnotationStyle)
Removes an annotation style.
item: The item to remove.
Returns: True if the item was removed; false otherwise.

Rhino.DocObjects.Tables.DimStyleTable.ModifyDimstyle(System.Int32,Rhino.DocObjects.AnnotationStyle)
Replaces the dimstyle in the document with this dimstyle
index:
dimstyle:
Returns: