Rhino.Geometry.AnnotationArrowhead.#ctor(Rhino.DocObjects.AnnotationStyle.ArrowType,System.Guid)
Constructotr
arrow_type:  AnnotationStyle.ArrowType of this arrowhead
block_id:  Guid of the block used for user defined display