Rhino.DocObjects.ManagedFont.FontStretch
Horizontal expansion or contraction of font

Rhino.DocObjects.ManagedFont.FontStretch.Unset
Not set.

Rhino.DocObjects.ManagedFont.FontStretch.Ultracondensed


Rhino.DocObjects.ManagedFont.FontStretch.Extracondensed


Rhino.DocObjects.ManagedFont.FontStretch.Condensed


Rhino.DocObjects.ManagedFont.FontStretch.Semicondensed


Rhino.DocObjects.ManagedFont.FontStretch.Medium
Default font stretch.

Rhino.DocObjects.ManagedFont.FontStretch.Semiexpanded


Rhino.DocObjects.ManagedFont.FontStretch.Expanded


Rhino.DocObjects.ManagedFont.FontStretch.Extraexpanded


Rhino.DocObjects.ManagedFont.FontStretch.Ultraexpanded
