GH_IO.Serialization.ID.System#IComparable{GH_IO#Serialization#ID}#CompareTo(GH_IO.Serialization.ID)
Compare two IDs. The name field in both cannot be null.
other: ID to compare to.
Returns: Comparison code.