GH_IO.Serialization.GH_Chunk.GetPath(System.String,System.String)
Gets the value of the item with the specified name.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
basePath: Base path for relative path resolution.
Returns: An array of path strings. If the resolved relative path is different from the stored absolute path, two strings will be returned.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name does not exist.

GH_IO.Serialization.GH_Chunk.GetPath(System.String,System.Int32,System.String)
Gets the value of the item with the specified name and index.
Name comparison is not case-sensitive.
item_name: Name of item to retrieve.
item_index: Index of item to retrieve.
basePath: Base path for relative path resolution.
Returns: An array of path strings. If the resolved relative path is different from the stored absolute path, two strings will be returned.
Throws System.OverflowException: Thrown if the type conversion fails.
Throws System.InvalidCastException: Thrown if the type conversion is invalid.
Throws System.NullReferenceException: Thrown if the item with the specified name and index does not exist.