Rhino.Geometry.AnnotationArrowhead
Arrowhead used by annotation

Rhino.Geometry.AnnotationArrowhead.#ctor
Constructotr

Rhino.Geometry.AnnotationArrowhead.#ctor(Rhino.DocObjects.DimensionStyle.ArrowType,System.Guid)
Constructotr
arrowType:  type of this arrowhead
blockId:  Guid of the block used for user defined display

Rhino.Geometry.AnnotationArrowhead.ArrowBlockId
Id of block used for user-defined arrowhead

Rhino.Geometry.AnnotationArrowhead.ArrowheadType
Type of arrowhead used by annotation