Rhino.DocObjects.AngularDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Line[]@,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)
viewport:
modelTransform:
lines:
arrowHeadTips:
arrowheadDirections:
Returns:

Rhino.DocObjects.AngularDimensionObject.DimensionStyle
Gets the Rhino.DocObjects.AngularDimensionObject.DimensionStyle
associated with this AngularDimensionObject.