Rhino.DocObjects.OrdinateDimensionObject
Represetns a Rhino.Geometry.OrdinateDimension
that is placed in a document.

Rhino.DocObjects.OrdinateDimensionObject.DimensionStyle
Gets the Rhino.DocObjects.OrdinateDimensionObject.DimensionStyle
associated with this OrdinateDimensionObject.