Rhino.Render.ChangeQueue.ChangeQueue.IsPreview
Return true if this ChangeQueue is created for preview rendering

Rhino.Render.ChangeQueue.ChangeQueue.ViewId
Return view ID for a RhinoDoc based ChangeQueue

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo)
Construct a new ChangeQueue from the given document
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:

Rhino.Render.ChangeQueue.ChangeQueue.CreateWorld
Signal the queue to do the initialisation of the queue, seeding it with the content currently available.

Rhino.Render.ChangeQueue.ChangeQueue.Flush
Tell the ChangeQueue to flush all collected events.

Rhino.Render.ChangeQueue.ChangeQueue.Finalize
Deconstructor

Rhino.Render.ChangeQueue.ChangeQueue.ProvideOriginalObject
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyLinearWorkflowChanges(Rhino.Render.ChangeQueue.LinearWorkflow)
Override this when you want to handle linear workflow changes

Rhino.Render.ChangeQueue.ChangeQueue.ApplyGammaChanges(System.Double)
Override this when you want to handle gamma changes
dGamma: