Rhino.Geometry.Brep.Repair(System.Double)
No support is available for this function.
Attempts to "right" a brep that is not faulty or incomplete.
tol: tolerance with which calculations are made.
Returns: True on success.