Rhino.DocObjects.V6AngularDimensionObject
A Rhino Object that represents a linear dimension geometry and attributes

Rhino.DocObjects.V6AngularDimensionObject.DimAngularGeometry
Get the dimension geometry for this object.

Rhino.DocObjects.V6AngularDimensionObject.DuplicateDimAngularGeometry
Constructs a deep (full) copy of the AngularDimension geometry.
Returns:
A copy of the internal V6LinearDimension geometry.