Rhino.Render.RenderSettings.FocalBlurModes
Possible modes for focal blur

Rhino.Render.RenderSettings.FocalBlurModes.None
No focal blur

Rhino.Render.RenderSettings.FocalBlurModes.Automatic
Automatic focal blur, focus on selected object

Rhino.Render.RenderSettings.FocalBlurModes.Manual
Manually specify all focal blur settings