Rhino.Geometry.V6Dimension.DimensionType
Type of dimension

Rhino.Geometry.V6Dimension.DimensionType.Unset


Rhino.Geometry.V6Dimension.DimensionType.Aligned


Rhino.Geometry.V6Dimension.DimensionType.Angular


Rhino.Geometry.V6Dimension.DimensionType.Diameter


Rhino.Geometry.V6Dimension.DimensionType.Radius


Rhino.Geometry.V6Dimension.DimensionType.Rotated


Rhino.Geometry.V6Dimension.DimensionType.Ordinate


Rhino.Geometry.V6Dimension.DimensionType.ArcLen


Rhino.Geometry.V6Dimension.DimensionType.Centermark
