TaskTypeListBuilder.#ctor(InstanceIdArray,System.String)
TaskTypeListBuilder constructor

TaskTypeListBuilder.Build(Rhino.Render.ContentArray)
Builds the list in the target
Returns: returns the required text width.