Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,System.Boolean)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
preview:
Type of mesh to build. If preview is true then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.

Rhino.DocObjects.RhinoObject.RenderMaterialInstanceId
Gets the instance ID of the render material associated with this object.
Andy says this was probably around before the RenderMaterial property
but it is only used internally now so I made it private.