Rhino.Geometry.AnnotationText.#ctor
Keeping private until we decide we need it

Rhino.Geometry.AnnotationText.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.AnnotationText.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Double,System.Double)
Create RichText geometry or null if input is invalid
richTextString:
plane:
style:
rectWidth:
rectHeight:
Returns:

Rhino.Geometry.AnnotationText.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)
Get the transform for this text object's text geometry
textscale:
dimstyle:

Rhino.Geometry.AnnotationText.PlainText
Returns unformatted string

Rhino.Geometry.AnnotationText.DimensionStyleId
Get this text's dimstyle id

Rhino.Geometry.AnnotationText.Height
Text height

Rhino.Geometry.AnnotationText.HorizontalAlignment
Text horizontal alignment

Rhino.Geometry.AnnotationText.VerticalAlignment
Text vertical alignment

Rhino.Geometry.AnnotationText.FormatWidth
Text format width (Wrapping rectangle)

Rhino.Geometry.AnnotationText.FormatHeight
Text format height (Wrapping rectangle)