Rhino.Geometry.V6AngularDimension
Represents an angular dimension.
ON_V6_DimAngular

Rhino.Geometry.V6AngularDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.V6AngularDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Get the transform for this text object's text geometry
style:
textscale:
camX:
camY:
draw_forward:

Rhino.Geometry.V6AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
style_id:
plane:
centerpoint:
defpoint1:
defpoint2:
dimlinepoint:
rotation_in_plane:
Returns:

Rhino.Geometry.V6AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane:
centerpoint:
defpoint1:
defpoint2:
dimlinepoint:
rotation_in_plane:
Returns:

Rhino.Geometry.V6AngularDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint:
defpoint1:
defpoint2:
arrowpoint1:
arrowpoint2:
dimlinepoint:
textpoint:
Returns: