Rhino.Geometry.V6OrdinateDimension
Represents an ordinate dimension.
ON_V6_DimOrdinate

Rhino.Geometry.V6OrdinateDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.V6OrdinateDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Get the transform for this text object's text geometry
style:
textscale:
camX:
camY:
draw_forward:

Rhino.Geometry.V6OrdinateDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.V6OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Initialize Dimension parameters
style_id:
plane:
direction:
basepoint:
defpoint:
leaderpoint:
kinkoffset1:
kinkoffset2:
Returns:

Rhino.Geometry.V6OrdinateDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.V6OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Update Dimension geometry from point locations
plane:
direction:
basepoint:
defpoint:
leaderpoint:
kinkoffset1:
kinkoffset2:
Returns:

Rhino.Geometry.V6OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
basepoint:
defpoint:
leaderpoint:
kinkpoint1:
kinkpoint2:
Returns: