Rhino.DocObjects.RLeaderObject
A Rhino Object that represents leader geometry and attributes

Rhino.DocObjects.RLeaderObject.LeaderGeometry
Get the Rhino.Geometry.Leader geometry for this object.

Rhino.DocObjects.RLeaderObject.DuplicateLeaderGeometry
Constructs a deep (full) copy of the Rhino.Geometry.RLeader geometry.
Returns:
A copy of the internal Rhino.Geometry.RLeader geometry.