Rhino.Render.RenderSettings.#ctor(Rhino.Render.RenderSettings)
Initializes a new instance of the Rhino.Render.RenderSettings class.

Rhino.Render.RenderSettings.FocalBlurMode
Get or set the focal blur mode

Rhino.Render.RenderSettings.FocalBlurSampleCount
Get or set the amount of focal blur samples to take

Rhino.Render.RenderSettings.FocalBlurDistance
Get or set the distance to the focal point to use for calculation
of focal blur

Rhino.Render.RenderSettings.FocalBlurAperture
Get or set the aperture to be used for focal blur calculation

Rhino.Render.RenderSettings.FocalBlurJitter
Get or set the jitter amount for focal blur