Rhino.Render.RealtimeDisplayModeClassInfo.ClassName
Get human-facing class name for RealtimeDisplayMode
implementation. This name will show up in the Rhino
UI.

Rhino.Render.RealtimeDisplayModeClassInfo.FullName
Get human-facing class description for RealtimeDisplayMode
implementation. This string might show up in the Rhino
UI.