Rhino.Render.Fields.IntField.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,System.Int32,System.Boolean)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.
key: Field key name
prompt: Field user interface prompt string
value: Initial value for this IntField
isTextured: Determines whether the texture control set is added to auto gen UIs for this field