Rhino.DocObjects.V6RadialDimensionObject
A Rhino Object that represents a radial dimension geometry and attributes

Rhino.DocObjects.V6RadialDimensionObject.DimRadialGeometry
Get the dimension geometry for this object.

Rhino.DocObjects.V6RadialDimensionObject.DuplicateDimRadialGeometry
Constructs a deep (full) copy of the LinearDimension geometry.
Returns:
A copy of the internal V6LinearDimension geometry.