Rhino.FileIO.File3dmObjectTable.Item(System.Int32)
Gets the File3dmObject at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of File3dmObject to access.
Throws System.ArgumentOutOfRangeException: Thrown when the index is invalid.
Returns: The File3dmObject at [index].