Rhino.DocObjects.Tables.LinetypeTable.Find(System.String)
Finds the linetype with a given name.
name: search ignores case.
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name.