Rhino.Render.ChangeQueue.LinearWorkflow
ChangeQueue LinearWorkflow

Rhino.Render.ChangeQueue.LinearWorkflow.#ctor(System.IntPtr)
Construct a ChangeQueue LinearWorkflow
pLw:

Rhino.Render.ChangeQueue.LinearWorkflow.Gamma
Get gamma

Rhino.Render.ChangeQueue.LinearWorkflow.GammaReciprocal
Get gamma reciprocal

Rhino.Render.ChangeQueue.LinearWorkflow.Active
True if linear workflow is active