Rhino.Geometry.CurveBlend
Represents a blend between two curves or surface edges
with specific continuity at each end

Rhino.Geometry.CurveBlend.#ctor
Makes a new uninitialized CurveBlend

Rhino.Geometry.CurveBlend.GetEndType(System.Int32)
Get type of target at this end
end: Which end of the blend

Rhino.Geometry.CurveBlend.SetEndType(System.Int32,Rhino.Geometry.CurveBlend.EndType)
Set type of target at this end
end: Which end of the blend
type: Curve or surface blend

Rhino.Geometry.CurveBlend.SetEdgeAngle(System.Int32,System.Double)
Rotation from perp to edge for surface blends

Rhino.Geometry.CurveBlend.GetEdgeAngle(System.Int32)
Rotation from perp to edge for surface blends

Rhino.Geometry.CurveBlend.SetContinuity(System.Int32,System.Int32)
0: position, 1: tangency, 2: curvature, 3: g3, 4: g4

Rhino.Geometry.CurveBlend.GetContinuity(System.Int32)
0: position, 1: tangency, 2: curvature, 3: g3, 4: g4

Rhino.Geometry.CurveBlend.SetScaleFactor(System.Int32,System.Double)
This multiplies the derivative lengths after they
have been calculated by whatever the normal way is

Rhino.Geometry.CurveBlend.GetScaleFactor(System.Int32)
Derivative length scales
end:  Which end

Rhino.Geometry.CurveBlend.SetDerLength(System.Int32,System.Int32,System.Double)
Set the length of a derivative of the blend curve
end: Which end of the blend
idx: Which derivative
length: New length

Rhino.Geometry.CurveBlend.GetDerLength(System.Int32,System.Int32)
Get the length of a derivative of the blend curve
end: Which end of the blend
idx: Which derivative

Rhino.Geometry.CurveBlend.GetTargetCurve(System.Int32)
Get the blend target curve
end: Which end
Returns: The target curve

Rhino.Geometry.CurveBlend.SetTargetCurve(System.Int32,Rhino.Geometry.Curve)
Set the target curve for one end of a blend
end: Which end
curve: The target curve

Rhino.Geometry.CurveBlend.GetTargetTrim(System.Int32)
Get the blend target trim
end: Which end
Returns: The target trim

Rhino.Geometry.CurveBlend.SetTargetTrim(System.Int32,Rhino.Geometry.BrepTrim)
Set the target trim for one end of a blend
end: Which end
trim: The target trim

Rhino.Geometry.CurveBlend.GetTargetPoint(System.Int32)
Get the blend target point
end: Which end
Returns: The target point

Rhino.Geometry.CurveBlend.SetTargetPoint(System.Int32,Rhino.Geometry.Point3d)
Set the target point for one end of a blend
end: Which end
point: The target point

Rhino.Geometry.CurveBlend.GetPickParameter(System.Int32)
Pick parameter on the target

Rhino.Geometry.CurveBlend.SetPickParameter(System.Int32,System.Double)
Set pick parameter for one end of a blend
end: Which end
pick_t: Pick parameter

Rhino.Geometry.CurveBlend.GetCurveParameter(System.Int32)
Parameter on curve underlying target

Rhino.Geometry.CurveBlend.SetCurveParameter(System.Int32,System.Double)
Set parameter on underlying curve
end: Which end
curve_t: The parameter

Rhino.Geometry.CurveBlend.GetFlip(System.Int32)
true: Reverse blend curvev direction

Rhino.Geometry.CurveBlend.SetFlip(System.Int32,System.Boolean)
Set flip tangent flag on one end of the blend
end: Which end
flip: flip or not

Rhino.Geometry.CurveBlend.GetReset(System.Int32)
Reset blend derivatives to default lengths

Rhino.Geometry.CurveBlend.SetReset(System.Int32,System.Boolean)
Set whether blend dericvative lengths are reset to default lengths
end: Which end
reset: Reset or not

Rhino.Geometry.CurveBlend.GetBlendBezier
Get the blend curve bezier as a NurbsCurve
Returns:

Rhino.Geometry.CurveBlend.DrawBlend(Rhino.Display.DisplayPipeline,System.Boolean)
Draw the blend
pPipe: pipeline to draw with
draw_handles: draw the adjuster handles or not

Rhino.Geometry.CurveBlend.CalcBlend
Calculate the shape of the blend and make a curve to represent it

Rhino.Geometry.CurveBlend.SetHandlePoint(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Set the location of a handle point on the blend
end: Adjust 0: start, 1: end
index: Point to adjust
position: New location

Rhino.Geometry.CurveBlend.HandlePoint(System.Int32,System.Int32)
Returns the location of a handle point of the blend
end: Get 0: start, 1: end
index: Point to get
Returns: Point location