Rhino.DocObjects.DimensionStyle.VerticalAlignment
Attachment of content

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Centered
Text centered on leader tail

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Above
Text above leader tail

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Below
Text below leader tail

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Top
Leader tail at top of text

Rhino.DocObjects.DimensionStyle.VerticalAlignment.FirstLine
Leader tail at middle of first text line

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Middle
Leader tail at middle of text or content

Rhino.DocObjects.DimensionStyle.VerticalAlignment.LastLine
Leader tail at middle of last text line

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Bottom
Leader tail at bottom of text

Rhino.DocObjects.DimensionStyle.VerticalAlignment.Underlined
Leader tail at bottom of text, text underlined