Rhino.FileIO.ICommonComponentTable`1.FindId(System.Guid)
Retrieves an object based on ID.
id: The id to search for.
Returns: A model component, or null if none was found.

Rhino.FileIO.ICommonComponentTable`1.FindIndex(System.Int32)
Retrieves an object based on Index.
index: The index to search for.
Returns: A model component, or null if none was found.