Rhino.Geometry.CurveBlend.BlendType
Describes the kind of connection to the target geometry that a CurveBlend has at its ends

Rhino.Geometry.CurveBlend.BlendType.CurveBlend
Makes a blended curve

Rhino.Geometry.CurveBlend.BlendType.SurfaceBlend
Makes a blended surface