Rhino.Geometry.RLeader
Leader geometry class

Rhino.Geometry.RLeader.#ctor(System.IntPtr,System.Object)
internal constructor
nativePointer:
parent:

Rhino.Geometry.RLeader.#ctor
Constructotr

Rhino.Geometry.RLeader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[],System.Guid)
Creates a RLeader geometry object
richTextString:
plane:
style:
points:
dimstyle_id:
Returns:

Rhino.Geometry.RLeader.Plane
Get and set Leaders Plane

Rhino.Geometry.RLeader.Curve
Gets the curve used by this leader

Rhino.Geometry.RLeader.TextString
Return text string for this leader

Rhino.Geometry.RLeader.SetTextString(System.String,Rhino.DocObjects.DimensionStyle)
Sets the text string for this leader

Rhino.Geometry.RLeader.TextHeight
Set or get the text height for this leader

Rhino.Geometry.RLeader.Points2D
Get or set the 2d points defining the curve used by this leader

Rhino.Geometry.RLeader.Points3D
Get or set the 3d points defining the curve used by this leader

Rhino.Geometry.RLeader.DimstyleId
Get or set the id of this leader's dimstyle

Rhino.Geometry.RLeader.ContentType
Type of annotation on the leader
Currently only text