Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean,Rhino.Render.AsyncRenderContext@)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: true if the rendering window should be reused; otherwise, a new one will be instantiated.
clearLastRendering:
true if the last rendering should be removed. Indicates that this
render is being done using RenderQuiet(). It specifically makes sure
the render mesh iterator does not display any progress user interface.
aRC: The asynchronous render context to set