Rhino.DocObjects.LinearDimensionObject.DimensionStyle
Gets the Rhino.DocObjects.LinearDimensionObject.DimensionStyle
associated with this LinearDimensionObject.

Rhino.DocObjects.LinearDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d[]@,Rhino.Geometry.Vector2d[]@)
viewport:
modelTransform:
arrowHeadTips:
arrowheadDirections:
Returns: