Rhino.Geometry.V6LinearDimension
Represents a linear dimension.
ON_V6_DimLinear

Rhino.Geometry.V6LinearDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.V6LinearDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Get the transform for this text object's text geometry
style:
textscale:
camX:
camY:
draw_forward:

Rhino.Geometry.V6LinearDimension.Create(Rhino.Geometry.V6Dimension.DimensionType,System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
dimtype:
style_id:
plane:
defpoint1:
defpoint2:
dimlinepoint:
rotation_in_plane:
Returns:

Rhino.Geometry.V6LinearDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
defpoint1:
defpoint2:
arrowpoint1:
arrowpoint2:
dimlinepoint:
textpoint:
Returns: