Rhino.Render.MenuTaskOriginFactory.NewButtonTaskOrigin(System.String)
Returns the menu task origin for new button

Rhino.Render.MenuTaskOriginFactory.CEC
Set the ContentEditingContext if the usercontrol has one

Rhino.Render.MenuTaskOriginFactory.SetController(System.IntPtr)
Set the Controller
pControl: The controller

Rhino.Render.MenuTaskOriginFactory.SetInstaceIdArray(System.IntPtr)
Set the InstanceIdArray: Array of selected items Guids
pInstanceArray: The InstanceIdArray