Rhino.Render.GroundPlane.m_doc_serial
Functions/Properties in this class do not need to check for RDK since
the only way to access the RDK is through the GroundPlane property on
the RhinoDoc. That property does the check before returning this class