Rhino.DocObjects.V6LinearDimensionObject
A Rhino Object that represents a linear dimension geometry and attributes

Rhino.DocObjects.V6LinearDimensionObject.DimLinearGeometry
Get the dimension geometry for this object.

Rhino.DocObjects.V6LinearDimensionObject.DuplicateDimLinearGeometry
Constructs a deep (full) copy of the LinearDimension geometry.
Returns:
A copy of the internal V6LinearDimension geometry.