Rhino.UI.ObjectPropertiesPage.ProertyPageType
Standard page types, override PageType and return one of these types to
replace a standard properties page with your page.

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Material
Replace the material page with this page, only works are the current render plug-in

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Light
Replace light page with this page, only works are the current render plug-in

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Custom
User defined custom page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Dimension
If page is provided by Rhino and only dimensions are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Leader
If page is provided by Rhino and leaders are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Text
If page is provided by Rhino and only text objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Hatch
If page is provided by Rhino and only hatch objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Dot
If page is provided by Rhino and only dot objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.TextureMapping
If page is provided by Rhino and only texture mapping widget objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Detail
If page is provided by Rhino and only detail objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.ClippingPlane
If page is provided by Rhino and only clipping plane objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.NamedView
If page is provided by Rhino and only named view widget objects are selected activate this page

Rhino.UI.ObjectPropertiesPage.ProertyPageType.Decal
If page is provided by Rhino and only decal widget objects are selected activate this page