Rhino.Display.ViewCaptureOld
Used to hold the information required to generate high resolution output
of a RhinoViewport.  This is used for generating paper prints or image files

Rhino.Display.ViewCaptureOld.Viewport
The RhinoViewport that this view capture info is based off of.

Rhino.Display.ViewCaptureOld.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Display.ViewCaptureOld.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().