Rhino.Geometry.MeshNgon
Represents a mesh ngon.

Rhino.Geometry.MeshNgon.BoundaryVertexCount
Get the number of vertices in this ngon.

Rhino.Geometry.MeshNgon.Item(System.Int32)
Get a mesh vertex index from the ngon's vertex index list.
index: A mesh vertex number between 0 and MeshNgon.VertexCount-1 that refers to a mesh vertex index in this ngon.
Returns: A mesh vertex index.

Rhino.Geometry.MeshNgon.BoundaryVertexIndexList
Get the ngon's outer boundary mesh vertex list.
Returns: A list of mesh vertex indexes.