Rhino.DocObjects.DimensionStyle.HorizontalAlignment
Attachment of content

Rhino.DocObjects.DimensionStyle.HorizontalAlignment.Left
Left aligned

Rhino.DocObjects.DimensionStyle.HorizontalAlignment.Center
Centered

Rhino.DocObjects.DimensionStyle.HorizontalAlignment.Right
Right aligned