Rhino.DocObjects.RadialDimensionObject.DisplayHelper(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,Rhino.Geometry.Point2d@,Rhino.Geometry.Vector2d@)
viewport:
modelTransform:
arrowHeadTip:
arrowheadDirection:
Returns:

Rhino.DocObjects.RadialDimensionObject.DimensionStyle
Gets the Rhino.DocObjects.RadialDimensionObject.DimensionStyle
associated with this RadialDimensionObject.