Rhino.Render.Fields.FieldDictionary.m_dictionary
Field dictionary used to store and access field values.

Rhino.Render.Fields.FieldDictionary.InternalDispose
Clean up the Field C++ pointers

Rhino.Render.Fields.FieldDictionary.FieldFromContent(System.String)
Search the underlying C++ content objects field list and return a
temporary Field object which can be used to access the field data.
The Field object can safely be disposed of when done.
key: Field dictionary key, it is case insensitive.
Returns:
Returns a temporary Field pointer attached to the C++ field if it is
found otherwise; returns null if it is not found.

Rhino.Render.Fields.FieldDictionary.FindField(System.String,System.Boolean)
Search dictionary for field that matches the key name, if the field is
not found in the runtime dictionary and searchContent is true the check
the content for the field, if the field is found on the content object
and addToDictionary is true then add it to the dictionary.
key: Look for a field with a matching Key value
searchContent: If this is true and the field is not found
in the runtime dictionary call FindContentField to search the content
object for the field.
Returns: Content field associated with the requested key or null if the
field is not found.

Rhino.Render.Fields.FieldDictionary.AddField(Rhino.Render.Fields.Field)
Add a new Field to the dictionary.  Will throw an exception if the key
is already in the dictionary or if value is not a supported type.
field:
The new Field object to add, this will not create the Fields C++
pointer, that happens later on after the dictionary C++ object has
been created.
Returns: Returns the newly added Field object.

Rhino.Render.Fields.FieldDictionary.SetTag(System.String,System.Object)
Sets an object that contains data to associate with the field.
key: Key name for the field to tag.
tag: Data to associate with the field.
Returns: True if the field is found and the tag was set otherwise false is returned.

Rhino.Render.Fields.FieldDictionary.TryGetTag(System.String,System.Object@)
Gets object that contains data associate with a field.
key: Key name of the field to get.
tag: Data associated with the field.
Returns:
Returns true if the field is found and its tag was retrieved otherwise;
returns false.