Rhino.Render.Fields.Field.m_auto_delete
If this is true then the m_fieldPointer is deleted when this object is
disposed of, if Attached is called when accessing data provided by
another plug-in then a temporary version of this field will be returned
and its value extracted by the RenderContent.FieldDictionary, in that
Attach is called instead of CreateCppPointer() so the m_fieldPointer
should not be deleted.

Rhino.Render.Fields.Field.m_initial_value
Place holder for the initial field value, this will get used by
CreateCppPointer(), it will call Set(m_initialValue) after creating the
C++ pointer to initialize the field value.

Rhino.Render.Fields.Field.FieldPointer
C++ pointer associated with this object, used for data access.

Rhino.Render.Fields.Field.Key
Field key value string set by constructor

Rhino.Render.Fields.Field.Prompt
Optional UI prompt string set by constructor

Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,System.Object,System.Boolean)
Field constructor
renderContent: RenderContent whose Fields owns this field.
attachToPointer: C++ pointer to attach to.
key: Unique key for this field
prompt: Display string used by the user interface
initialValue:
Initial value used to initialize the field after creating the C++
pointer.
isTextured: Determines whether auto-UIs will show the texture control set

Rhino.Render.Fields.Field.CreateCppPointer(Rhino.Render.RenderContent,System.IntPtr)
Create the RDK C++ field object and set its initial value, fields are
added to a RenderContent.FieldDictionary in the RenderContent
constructor before the RenderContent C++ pointer is created, the
RenderContent C++ pointer is required when creating a field in order
for the field to get added to the RenderContent C++ Field list so this
method is called by RenderContent when it is safe to create the Field
C++ pointers.
content: RenderContent.FiledDictionary that owns this Field.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Field.IneternalDispose
IDisposable required method

Rhino.Render.Fields.Field.FieldFromPointer(Rhino.Render.RenderContent,System.IntPtr,System.String)
Create a Field[data type] object from a content field pointer using its values
variant type to figure out what kind of Field[data type] object to return.
renderContent: RenderContent whose Fields dictionary the field belongs to.
fieldPointer:
C++ pointer to the field object, will throw a ArgumentNullException if this
value is null.
key: Key value for the new field
Returns: