Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes.Tiny
Tiny thumbnails.

Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes.Small
Small thumbnails.

Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes.Medium
Medium thumbnails.

Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes.Large
Large thumbnails.

Rhino.UI.Controls.IRhRdkContentThumbnailList_Sizes.Custom
Custom-sized thumbnails.