Rhino.DocObjects.DimensionStyle.ContentAngle
Angle for text or other leader content

Rhino.DocObjects.DimensionStyle.ContentAngle.Horizontal
Horizontal in coordinate system

Rhino.DocObjects.DimensionStyle.ContentAngle.Aligned
Aligned with last leader direction

Rhino.DocObjects.DimensionStyle.ContentAngle.Rotated
Explicit angle

Rhino.DocObjects.DimensionStyle.ContentAngle.HorizontalToScreen
Stays horizontal and front facing