Rhino.Geometry.V6RadialDimension
Represents a radial dimension.
ON_V6_DimRadial

Rhino.Geometry.V6RadialDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.V6RadialDimension.GetTextTransform(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Get the transform for this text object's text geometry
style:
textscale:
camX:
camY:
draw_forward:

Rhino.Geometry.V6RadialDimension.Create(System.Guid,Rhino.Geometry.V6Dimension.DimensionType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
style_id:
dimtype:
plane:
centerpoint:
radiuspoint:
dimlinepoint:
Returns:

Rhino.Geometry.V6RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane:
centerpoint:
radiuspoint:
dimlinepoint:
rotation_in_plane:
Returns:

Rhino.Geometry.V6RadialDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint:
radiuspoint:
kneepoint:
dimlinepoint:
Returns: