Rhino.DocObjects.AnnotationObjectBase.GetTextXform(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Transform,System.Double,Rhino.Geometry.Transform@)
viewport: can be null
modelTransform:
detailScale:
gdiToWorld:
Returns:

Rhino.DocObjects.AnnotationObjectBase.GetArrowHeadCorners3d(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d,System.Double)
Get the corners of a polygon that contains the arrowhead
direction: direction of arrow head in annotation plane coordinates (ECS)
tip: location of arrowhead tip in annotation plane coordinates (ECS)
scale:
Returns: The arrowhead polygon corners

Rhino.DocObjects.AnnotationObjectBase.GetArrowHeadCorners2d(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d,System.Double)
Get the corners of a polygon that contains the arrowhead
direction: direction of arrow head in annotation plane coordinates (ECS)
tip: location of arrowhead tip in annotation plane coordinates (ECS)
scale:
Returns: The arrowhead polygon corners

Rhino.DocObjects.AnnotationObjectBase.DimScale(Rhino.Display.RhinoViewport)
I really would like to change the name of this function to something more descriptive
viewport:
Returns: