Rhino.FileIO.CommonComponentTable`1.FindIndex(System.Int32)
Uses the index to find a model component.
The index is the value that is stored in the .Index property.
index: Index of model component to search for.
Returns: Reference to the rhino object or null if no such object could be found.