Rhino.DocObjects.V6OrdinateDimensionObject
A Rhino Object that represents a linear dimension geometry and attributes

Rhino.DocObjects.V6OrdinateDimensionObject.DimOrdinateGeometry
Get the dimension geometry for this object.

Rhino.DocObjects.V6OrdinateDimensionObject.DuplicateDimOrdinateGeometry
Constructs a deep (full) copy of the OrdinateDimension geometry.
Returns:
A copy of the internal V6LinearDimension geometry.