Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.AnnotationText)
Adds a rich text object to the document.
richText:
Rich text object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.AnnotationText,Rhino.DocObjects.ObjectAttributes)
Adds a rich text object to the document.
richText: Rich text object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRichText(Rhino.Geometry.AnnotationText,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a rich text object to the document.
richText: Rich text object to add.
attributes: Attributes to apply to rich text.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader)
Adds a Leader object to the document.
rleader: The leader object.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader,Rhino.DocObjects.ObjectAttributes)
Adds a Leader object to the document.
rleader: The leader object.
attributes: Attributes to apply to rich text.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddRLeader(Rhino.Geometry.RLeader,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a Leader object to the document.
rleader: The leader object.
attributes: Attributes to apply to rich text.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6LinearDimension(Rhino.Geometry.V6LinearDimension)
Adds a linear dimension object to the document.
dimlinear:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6LinearDimension(Rhino.Geometry.V6LinearDimension,Rhino.DocObjects.ObjectAttributes)
Adds a linear dimension object to the document.
dimlinear: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6LinearDimension(Rhino.Geometry.V6LinearDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a linear dimension object to the document.
dimlinear: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6AngularDimension(Rhino.Geometry.V6AngularDimension)
Adds a angular dimension object to the document.
dimangular:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6AngularDimension(Rhino.Geometry.V6AngularDimension,Rhino.DocObjects.ObjectAttributes)
Adds a angular dimension object to the document.
dimangular: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6AngularDimension(Rhino.Geometry.V6AngularDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an angular dimension object to the document.
dimangular: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6RadialDimension(Rhino.Geometry.V6RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a radial dimension object to the document.
dimradial: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6OrdinateDimension(Rhino.Geometry.V6OrdinateDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
dimordinate: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.AddV6Centermark(Rhino.Geometry.V6Centermark,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
centermark: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.AnnotationText)
Replaces one object with new text object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
text: new text to be added.  The text is copied.
Returns: true if successful.

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.AnnotationText)
Replaces one object with new text object.
objectId: Id of object to be replaced.
text: new text to be added.  The text is copied.
Returns: true if successful.