Rhino.Input.RhinoGet.GetRectangleWithCounts(System.String,System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle with prompts for counts in X and Y directions.
variety: Use "Point" for a point grid, "Face" for a meshplane, "Widget" for a rectangle with widget count prompts, etc.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.

Rhino.Input.RhinoGet.GetBoxWithCounts(System.String,System.Int32,System.Int32@,System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d box with prompts for counts in X, Y and Z directions.
variety: Use "Point" for a point grid, "Face" for a meshbox, "Widget" for a box with widget count prompts, etc.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
zMin: Minimum value allowed for count in the z direction.
zCount: Count in the z direction.
corners: corners of the bottom rectangle in counter-clockwise order, followed by top recatngle.
Returns: Commands.Result.Success if successful.