Rhino.DocObjects.DimensionStyle.LeaderContentType
Type of leader content

Rhino.DocObjects.DimensionStyle.LeaderContentType.None


Rhino.DocObjects.DimensionStyle.LeaderContentType.Text


Rhino.DocObjects.DimensionStyle.LeaderContentType.TextDot


Rhino.DocObjects.DimensionStyle.LeaderContentType.Block
