Rhino.Render.RealtimeDisplayMode.SetView(Rhino.DocObjects.ViewInfo)
Set ViewInfo for this RealtimeDisplayMode instance.
view:

Rhino.Render.RealtimeDisplayMode.SetUseLinearWorkflowGamma(System.Boolean)
Set whether linear workflow is used.
useLinearWorkflowGamma:

Rhino.Render.RealtimeDisplayMode.SetGamma(System.Single)
Set gamma for this RealtimeDisplayMode
gamma:

Rhino.Render.RealtimeDisplayMode.StartRenderer(System.UInt32,System.UInt32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)
Override to start your render engine
w:
h:
doc:
view:
viewportInfo:
forCapture:
renderWindow:
Returns: true when your render engine started correctly, false when that failed

Rhino.Render.RealtimeDisplayMode.IsCompleted
Override to tell if your render engine has completed a frame for drawing into the viewport
Returns: