Rhino.UI.Controls.Thumbnail.CppPointer
Thumbnail c++ pointer

Rhino.UI.Controls.Thumbnail.#ctor(System.IntPtr)
Constructor for Thumbnail

Rhino.UI.Controls.Thumbnail.Finalize
Destructor for Thumbnail

Rhino.UI.Controls.Thumbnail.Dispose
Dispose for Thumbnail