Rhino.Geometry.CurveBlend.EndType
Describes the kind of connection to the target geometry that a CurveBlend has at its ends.

Rhino.Geometry.CurveBlend.EndType.Unset
No type has been set.

Rhino.Geometry.CurveBlend.EndType.Point
The blend connects to a 3d point location with position continuity.

Rhino.Geometry.CurveBlend.EndType.Curve
The blend connects to a curve. Continuity and location on the curve are
described in m_continuity, m_curve_t and m_bFlip.

Rhino.Geometry.CurveBlend.EndType.Face
The curve connects to the edge of a surface. Continuity and location on the
surface edge are described by m_continuity, m_trim_t and m_edge_angle.