Rhino.Geometry.TextEntity.MaskOffset
Offset for the border around text of the rectangle used to draw the mask.  This
value multiplied by TextHeight is the offset on each side of the tight rectangle
around the text characters to the mask rectangle. The default value is 0.1.