Rhino.Geometry.V6Centermark
Represents a centermark.
ON_V6_Centermark

Rhino.Geometry.V6Centermark.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.V6Centermark.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
style_id:
plane:
centerpoint:
radius:
Returns:

Rhino.Geometry.V6Centermark.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d)
Update Dimension geometry from point locations
plane:
centerpoint:
Returns: