Rhino.DocObjects.DimensionStyle.LengthDisplayFormat
Defines display formats for distances.

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.Decimal
Decimal units.

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.Fractional
Fractional units.

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.FeetInches
Feet and Inches.

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.FeetDecimalInches
Feet and Decimal Inches.