Rhino.Geometry.V6OrdinateDimension.MeasuredDirection
Ordinate dimension measures x or y direction

Rhino.Geometry.V6OrdinateDimension.MeasuredDirection.Unset


Rhino.Geometry.V6OrdinateDimension.MeasuredDirection.Xaxis
Measures horizontal distance

Rhino.Geometry.V6OrdinateDimension.MeasuredDirection.Yaxis
Measures vertical distance