Rhino.UI.Controls.IRhRdkThumbnailList_Modes.Grid
Big thumbnails like Explorer icon mode (default).

Rhino.UI.Controls.IRhRdkThumbnailList_Modes.List
Small thumbnails and info on right like Explorer report mode.

Rhino.UI.Controls.IRhRdkThumbnailList_Modes.Tree
Tree view mode.