Rhino.DocObjects.Tables.LightTable.FindName(System.String,System.Guid)
Finds the LightObject with a given name.
Deleted layers have no name.
layerName: name of layer to search for. The search ignores case.
parentId: Id of the parent layer to search.
Returns:
A layer. If no layer is found, null is returned.

Rhino.DocObjects.Tables.LightTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Layer given its name hash.
nameHash: The name hash of the Layer to be searched.
Returns: An Layer, or null on error.