Rhino.Render.RenderContent.Document
Get the document this content belongs to or null if the content has not
yet been added to a document.  This will be null when content is
generated for browsers or preview generation.

Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)
Icon to display in the content browser, this bitmap needs to be valid for
the life of this content object, the content object that returns the bitmap
is responsible for disposing of the bitmap.
size:
Requested icon size
bitmap:
Returns:
Return Icon to display in the content browser.