Rhino.DocObjects.DimensionStyle.Field.TextAlignment


Rhino.DocObjects.DimensionStyle.Field.LengthFormat


Rhino.DocObjects.DimensionStyle.Field.LengthFactor


Rhino.DocObjects.DimensionStyle.Field.AlternateLengthFactor


Rhino.DocObjects.DimensionStyle.Field.AlternateLengthFormat


Rhino.DocObjects.DimensionStyle.Field.ToleranceZeroSuppress


Rhino.DocObjects.DimensionStyle.Field.LdrContentType


Rhino.DocObjects.DimensionStyle.Field.LdrVerticalAlignment


Rhino.DocObjects.DimensionStyle.Field.ContentAngle


Rhino.DocObjects.DimensionStyle.Field.LdrCurveType


Rhino.DocObjects.DimensionStyle.Field.LeaderHorizontalAlignment


Rhino.DocObjects.DimensionStyle.Field.UnitSystem
