Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters)
Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
boundary: must be a closed planar curve.
parameters: parameters used for creating the mesh.
Returns:
New mesh on success or null on failure.