Rhino.DocObjects.V6CentermarkObject
A Rhino Object that represents a centermark geometry and attributes

Rhino.DocObjects.V6CentermarkObject.CentermarkGeometry
Get the dimension geometry for this object.

Rhino.DocObjects.V6CentermarkObject.DuplicateDimOrdinateGeometry
Constructs a deep (full) copy of the Centermark geometry.
Returns:
A copy of the internal V6LinearDimension geometry.