Rhino.Render.MenuTask.MenuString(Rhino.Render.MenuTaskOrigin,System.String)
Returns the title of the menutask
origin: The menutask origin.
kind: kind as a string. E.g environment, material, texture ...
Returns: Returns the menutask title string

Rhino.Render.MenuTask.IconOut(System.String,System.Int32)
Returns the associated out icon for the menutask item.
Out icon is the icon displayed if the menu task is not selected.
kind: kind as a string. E.g environment, material, texture ...
size: The size of the icon.
Returns: Returns a bitmap representing the icon

Rhino.Render.MenuTask.IconIn(System.String,System.Int32)
Returns the associated in icon for the menutask item.
Out icon is the icon displayed if the menu task is not selected and the in icon is
represents that the menutask is selected. If the menutask does not contain two states
then the IconIn will return the same icon as IconOut
kind: kind as a string. E.g environment, material, texture ...
size: The size of the icon.
Returns: Returns a bitmap representing the icon