Rhino.DocObjects.RichTextObject
A Rhino Object that represents rich text geometry and attributes

Rhino.DocObjects.RichTextObject.TextGeometry
Get the Rhino.Geometry.AnnotationText geometry for this object.